04_OpenFoam/_Tut_02/OpenFOAM-14/multicomponentFluid/verticalChannelSteady/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p.*"
    {
        solver           GAMG;

        tolerance        0;
        relTol           0.05;

        smoother         DICGaussSeidel;



        maxIter          50;
    };

    Phi
    {
        $p;
    }

    "(U|Yi|h|k|omega).*"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       0;
        relTol          0.1;
        maxIter         20;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 5;
}

PIMPLE
{
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    fields
    {
        p               0.3;
        rho             1;
    }

    equations
    {
        U               0.7;
        h               0.7;
        ".*"            0.7;
    }
}


// ************************************************************************* //
